burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_pkcau.c
        /* write the modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000D5CU, mont_para->modulus_n, mont_para->modulus_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_MONT_PARAM);
        /* start computation */
        pkcau_start();
    }
}

/*!
    \brief      execute modular operation, include modular addition, modular subtraction and montgomery multiplication (API_ID(0x0012U))
    \param[in]  mod_para: PKCAU modular parameter struct
                  oprd_a: operand A
                  oprd_b: operand B
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
    \param[in]  mode: modular operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_ADD: modular addition
      \arg        PKCAU_MODE_MOD_SUB: modular subtraction
      \arg        PKCAU_MODE_MONT_MUL: Montgomery multiplication
    \param[out] none
    \retval     none
*/
void pkcau_mod_operation(pkcau_mod_parameter_struct *mod_para, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(mod_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t bit_len = mod_para->modulus_len * 8U;

        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, bit_len);
        
        /* write the operand A, operand B and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x000008B4U, mod_para->oprd_a, mod_para->modulus_len);
        pkcau_memcpy_operand(0x00000A44U, mod_para->oprd_b, mod_para->modulus_len);
        pkcau_memcpy_operand(0x00000D5CU, mod_para->modulus_n, mod_para->modulus_len);
        /* configure the operation mode */
        pkcau_mode_set(mode);
        /* start computation */
        pkcau_start();
    }
}

/*!
    \brief      execute modular exponentation operation (API_ID(0x0013U))
    \param[in]  mont_para: PKCAU exponentation parameter struct for fast mode
                  oprd_a: operand A
                  exp_e: exponent e
                  e_len: exponent length in byte
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
                  mont_para: montgomery parameter R2 mod n
    \param[in]  mode: modular exponentation operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_EXP: montgomery parameter computation then modular exponentiation
      \arg        PKCAU_MODE_MOD_EXP_FAST: modular exponentiation only
    \param[out] none
    \retval     none
*/
void pkcau_mod_exp_operation(pkcau_mod_exp_parameter_struct *mod_exp_para, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(mod_exp_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t e_bit_len = mod_exp_para->e_len * 8U;
        uint32_t n_bit_len = mod_exp_para->modulus_len * 8U;
        
        /* write the exponent length and modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000400U, e_bit_len);
        pkcau_memcpy_value(0x00000404U, n_bit_len);
        
        /* write the operand A, exponent e and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000A44U, mod_exp_para->oprd_a, mod_exp_para->modulus_len);
        pkcau_memcpy_operand(0x00000BD0U, mod_exp_para->exp_e, mod_exp_para->e_len);
        pkcau_memcpy_operand(0x00000D5CU, mod_exp_para->modulus_n, mod_exp_para->modulus_len);
        /* write the montgomery parameter to PKCAU RAM */
        if(mode == PKCAU_MODE_MOD_EXP_FAST){
            pkcau_memcpy_operand(0x00000594U, mod_exp_para->mont_para, mod_exp_para->modulus_len);
        }
        /* configure the operation mode */
        pkcau_mode_set(mode);
        /* start computation */
        pkcau_start();
    }
}

/*!
    \brief      execute modular inversion operation (API_ID(0x0014U))
    \param[in]  mod_inver_para: PKCAU modular inversion parameter struct
                  oprd_a: operand A
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
    \param[out] none
    \retval     none
*/
void pkcau_mod_inver_operation(pkcau_mod_inver_parameter_struct *mod_inver_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(mod_inver_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t bit_len = mod_inver_para->modulus_len * 8U;
        
        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, bit_len);
        
        /* write the operand A and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x000008B4U, mod_inver_para->oprd_a, mod_inver_para->modulus_len);
        pkcau_memcpy_operand(0x00000A44U, mod_inver_para->modulus_n, mod_inver_para->modulus_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_MOD_INVERSION);
        /* start computation */
        pkcau_start();
    }
}

/*!
    \brief      execute modular reduction operation (API_ID(0x0015U))
    \param[in]  mod_reduc_para: PKCAU modular reduction parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
    \param[out] none
    \retval     none
*/
void pkcau_mod_reduc_operation(pkcau_mod_reduc_parameter_struct *mod_reduc_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(mod_reduc_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t n_bit_len = mod_reduc_para->modulus_len * 8U;
        uint32_t a_bit_len = mod_reduc_para->oprd_a_len * 8U;
        
