burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_pkcau.c
        /* write the curve coefficient a to PKCAU RAM */
        pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->modulus_p_len);
        /* write the curve modulus p to PKCAU RAM */
        pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
        /* write the integer k to PKCAU RAM */
        pkcau_memcpy_operand(0x00000508U, k, curve_group_para->modulus_p_len);
        /* write the curve base point coordinate x to PKCAU RAM */
        pkcau_memcpy_operand(0x0000055CU, curve_group_para->base_point_x, curve_group_para->modulus_p_len);
        /* write the curve base point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x000005B0U, curve_group_para->base_point_y, curve_group_para->modulus_p_len);
        /* write the hash value z and hash value z length in byte to PKCAU RAM */
        pkcau_memcpy_operand(0x00000DE8U, hash_para->hash_z, hash_para->hash_z_len);
        /* write the private key d to PKCAU RAM */
        pkcau_memcpy_operand(0x00000E3CU, p_key_d, curve_group_para->modulus_p_len);
        /* write the curve prime order n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000E94U, curve_group_para->order_n, curve_group_para->order_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_ECDSA_SIGN);
        /* start computation */
        pkcau_start();
    }
}

/*!
    \brief      execute ECDSA verification operation (API_ID(0x001BU))
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_y: point coordinate y
    \param[in]  hash_para: hash struct
                  hash_z: hash value z
                  hash_z_len: hash value z length in byte
    \param[in]  signature_para: signature struct
                  sign_r: signature part r
                  sign_s: signature part s
    \param[in]  curve_group_para: PKCAU ECC curve paramter struct
                  modulus_p: curve modulus p
                  coff_a: curve coefficient a
                  coff_b: curve coefficient b
                  base_point_x: curve base point coordinate x
                  base_point_y: curve base point coordinate y
                  order_n: curve prime order n
                  a_sign: curve coefficient a sign
                  modulus_p_len: curve modulus p length in byte
                  order_n_len: curve prime order n length in byte
                  multi_k: scalar multiplier k
                  k_len: length of scalar multiplier k
                  mont_para: montgomery parameter R2 mod n
    \param[out] none
    \retval     none
*/
void pkcau_ecdsa_verification_operation(pkcau_point_parameter_struct *point_para, \
                              pkcau_hash_parameter_struct *hash_para, \
                              pkcau_signature_parameter_struct *signature_para, \
                              const pkcau_ec_group_parameter_struct* curve_group_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(point_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(hash_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(signature_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(curve_group_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t max_len_in_bit = curve_group_para->modulus_p_len * 8U;

        /* write the curve prime order n length, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, curve_group_para->order_n_len * 8U);
        pkcau_memcpy_value(0x000004B4U, max_len_in_bit);
        pkcau_memcpy_value(0x0000045CU, curve_group_para->a_sign);
        
        /* write the curve coefficient a to PKCAU RAM */
        pkcau_memcpy_operand(0x00000460U, curve_group_para->coff_a, curve_group_para->modulus_p_len);
        /* write the curve modulus p to PKCAU RAM */
        pkcau_memcpy_operand(0x000004B8U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
        /* write the curve base point coordinate x to PKCAU RAM */
        pkcau_memcpy_operand(0x000005E8U, curve_group_para->base_point_x, curve_group_para->modulus_p_len);
        /* write the curve base point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x0000063CU, curve_group_para->base_point_y, curve_group_para->modulus_p_len);
        /* write the point coordinate x to PKCAU RAM */
        pkcau_memcpy_operand(0x00000F40U, point_para->point_x, curve_group_para->modulus_p_len);
        /* write the point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x00000F94U, point_para->point_y, curve_group_para->modulus_p_len);
        /* write the signature part r to PKCAU RAM */
        pkcau_memcpy_operand(0x000001098U, signature_para->sign_r, curve_group_para->modulus_p_len);
        /* write the signature part s to PKCAU RAM */
        pkcau_memcpy_operand(0x00000A44U, signature_para->sign_s, curve_group_para->modulus_p_len);
        /* write the hash value z and hash value z length in byte to PKCAU RAM */
        pkcau_memcpy_operand(0x00000FE8U, hash_para->hash_z, hash_para->hash_z_len);
        /* write the curve prime order n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000D5CU, curve_group_para->order_n, curve_group_para->order_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_ECDSA_VERIFICATION);
        /* start computation */
        pkcau_start();
    }
}

/*!
    \brief      read result from PKCAU RAM (API_ID(0x001CU))
    \param[in]  offset: RAM address offset to PKCAU base address
    \param[out] buf: big endian result buffer, the left most byte from the PKCAU should be in the first element of buffer
    \param[in]  size: number of byte to read
    \retval     none
*/
void pkcau_memread(uint32_t offset, uint8_t buf[], uint32_t size)
{
    uint32_t  data = 0U, i = 0U, j = 0U;
    
